{"data":{"allMarkdownRemark":{"edges":[{"node":{"id":"4538486f-ad4b-5533-b8b2-3e5e1b9b3859","html":"<p>I am the Research Assistant for the NSF funded-project <a href=\"https://www.kayladesportes.com/project/dab/\">DAB!</a>. The project integrates data science, machine learning, and physical computing in the context of dance and cheerleading. As a component of this work, I am developing danceON, a web-based programming environment for describing animations that respond to body position and movement using a declarative syntax [video | demo].</p>\n<p>Advisors: <a href=\"https://steinhardt.nyu.edu/people/yoav-bergner\">Yoav Bergner</a>, <a href=\"https://www.kayladesportes.com/\">Kayla Desportes (PI)</a></p>","rawMarkdownBody":"I am the Research Assistant for the NSF funded-project [DAB!](https://www.kayladesportes.com/project/dab/). The project integrates data science, machine learning, and physical computing in the context of dance and cheerleading. As a component of this work, I am developing danceON, a web-based programming environment for describing animations that respond to body position and movement using a declarative syntax [video | demo].\n\nAdvisors: [Yoav Bergner](https://steinhardt.nyu.edu/people/yoav-bergner), [Kayla Desportes (PI)](https://www.kayladesportes.com/)\n","frontmatter":{"title":"Dancing Across Boundaries!"}}},{"node":{"id":"96c33b85-8b97-5a37-aa89-f8cf1d949edc","html":"<p>I design musical interactions and interfaces that are accessible to a wide range of users with diverse abilities. I am especially interested in making music computing more accessible in collaboration with people with no vision or low vision. My team developed a screen-reader friendly prototype of a circular drum-machine [video | demo].</p>\n<p>I recently interned at the Hands-Free Music Project at Microsoft Research. I also work as the Accessible Music Technology Fellow at the <a href=\"https://fmdgmusicschool.org\">Filomen M D'Agostino Greenberg (FMDG) Music School</a> where I transcribe sheet music to convert to braille/large print, and learn from educators who are experts at teaching blind and visually impaired musicians.</p>\n<p>Advisor: <a href=\"https://amyhurst.com\">Amy Hurst</a></p>\n<p>Undergrad Research Assistants: Fabiha Ahmed, Lisa Ye, Michael Zachor, Alex Yixuan Xu (Alum)</p>","rawMarkdownBody":"I design musical interactions and interfaces that are accessible to a wide range of users with diverse abilities. I am especially interested in making music computing more accessible in collaboration with people with no vision or low vision. My team developed a screen-reader friendly prototype of a circular drum-machine [video | demo].\n\nI recently interned at the Hands-Free Music Project at Microsoft Research. I also work as the Accessible Music Technology Fellow at the [Filomen M D'Agostino Greenberg (FMDG) Music School](https://fmdgmusicschool.org) where I transcribe sheet music to convert to braille/large print, and learn from educators who are experts at teaching blind and visually impaired musicians.\n\nAdvisor: [Amy Hurst](https://amyhurst.com)\n\nUndergrad Research Assistants: Fabiha Ahmed, Lisa Ye, Michael Zachor, Alex Yixuan Xu (Alum)\n","frontmatter":{"title":"Non-Visual Beats"}}}]}}}